name: Remote Service Psexec Command Line Exe
id: 9364ee8e-a39a-11eb-8f1d-acde48001345
version: 1
date: '2023-03-17'
author: Michael Haag,Darin Manley, Splunk
type: Anomaly
datamodel:
- Endpoint
description: A new service was installed by the user indicated in the subject. Subject often identifies 
  the local system (SYSTEM) for services installed as part of native Windows components and therefore you 
  can't determine who actually initiated the installation.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.process_id) as process_id count min(_time) as firstTime max(_time)
  as lastTime  from datamodel=Endpoint.Processes where Processes.process_name = "psexec.exe" OR Processes.process_name = "sc.exe"
  by Processes.process_name Processes.parent_process_name Processes.dest Processes.user _time span=1m |`drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `remote_service_psexec_command_line_exe_filter` '
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed psexec.exe or sc.exe may be used.
known_false_positives: False positives should be limited as this behavior is not normal
  for `psexec.exe` or 'sc.exe' to spawn cmd.exe inconjuntion with access tokens.
references:
- https://atomicredteam.io/execution/T1569.002/
- https://abhijithraom.medium.com/lateral-movement-detections-psexec-like-psexec-tools-activity-a305791280f7
- https://github.com/redcanaryco/atomic-red-team/blob/8025353c3dc163b93fc6348530d4c5884792608f/atomics/T1569.002/T1569.002.md#atomic-test-3---psexecpy-impacket
tags:
  analytic_story:
  - Cobalt Strike
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Collection
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1560.001/archive_utility/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$. This behavior is indicative of suspicious loading
    of 7zip.
  mitre_attack_id:
  - T1569.002
  - T1569
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.parent_process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 64
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint